УТ_для_edt/src/ExchangePlans/смартОбменСоСкладомАтлант/смартОбменСоСкладомАтлант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="02fb43b5-8949-4bce-a2cf-51b86de2c64d">
  <name>смартОбменСоСкладомАтлант</name>
  <comment>#Б-2746 смарт: Лопато 31.03.2025 //Интеграция с WMS. Атлант. Выгрузка номенклатуры</comment>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйКонтур</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АтлантFTPАдрес</name>
    <comment>#Б-2520 смарт: Лопато 03.03.2025 //Интеграция с WMS. Атлант. Подготовительные работы. Настройки, метаданные, модули. Настройка подключения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АтлантFTPЛогин</name>
    <comment>#Б-2520 смарт: Лопато 03.03.2025 //Интеграция с WMS. Атлант. Подготовительные работы. Настройки, метаданные, модули. Настройка подключения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АтлантFTPПароль</name>
    <comment>#Б-2520 смарт: Лопато 03.03.2025 //Интеграция с WMS. Атлант. Подготовительные работы. Настройки, метаданные, модули. Настройка подключения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АтлантFTPНастройкиОтбораНоменклатуры</name>
    <comment>#Б-2746 смарт: Лопато 31.03.2025 //Интеграция с WMS. Атлант. Выгрузка номенклатуры</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

УТ_для_edt/src/ExchangePlans/смартОбменСоСкладомАтлант/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////
//                                                           //
//  ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ								//
//                                                         //
////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриЧтенииСозданииНаСервере(ТекущийОбъект = НеОпределено)
	
	Если НЕ ТекущийОбъект = Неопределено Тогда
		
		УстановитьРасписаниеРегламентногоЗаданияПриЧтенииНаСервере(ТекущийОбъект);
		
		Возврат;
	
	КонецЕсли;
	
	ИнициализироватьАтлантНастройкиОтбораНоменклатуры();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере(ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНадписьРасписанияОбмена();   
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Проверка уникальности имени
	Если ЗначениеЗаполнено(ПланыОбмена.смартОбменСоСкладомАтлант.НайтиПоНаименованию(ТекущийОбъект.Наименование, Истина)) 
		И НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		
		Сообщить("Уже существует настройка с таким именем. Сохранение невозможно.");	

		Отказ = Истина;

		Возврат;
		
	КонецЕсли;
	
	ТекущийОбъект.АтлантFTPНастройкиОтбораНоменклатуры = 
		Новый ХранилищеЗначения(ЭтаФорма.КомпоновщикНастроекОтбораНоменклатурыАтлант.ПолучитьНастройки(), Новый СжатиеДанных(9));
		
	//Активация регламентного задания
	Если ТекущийОбъект.ИспользоватьРегламентныеЗадания Тогда

		УстановитьПривилегированныйРежим(Истина);

		Если ТекущийОбъект.Код <> "" Тогда
			
			Задание = ТекущийОбъект.ПолучитьРегламентноеЗадание();
			
			Если Задание = Неопределено Тогда
				
				Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("смартЗаданиеОбменСоСкладомАтлант");
				Задание.Использование = Истина;
				Задание.Ключ = Строка(Новый УникальныйИдентификатор);
				Задание.Наименование = ТекущийОбъект.Наименование;
				
				ТекущийОбъект.ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
				
			КонецЕсли;
			
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(ТекущийОбъект.Код);
			
			Задание.Параметры = ПараметрыЗадания;
			Задание.Расписание = РасписаниеРегламентногоЗадания;
			
			Задание.Записать();
			
		Иначе
			Сообщить("Код настройки не прописался в регламентном задании. Необходимо переуказать регламентное задание настройку обмена");	
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
		
	Если ЭтаФорма.Модифицированность тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры), 
					   "Изменения не будут сохранены. Продолжить закрытие?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Закрыть();	
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПоРаботеСРегламентнымиЗаданиями

////////////////////////////////////////////////////////////////
//                                                           //
//  ПРОЦЕДУРЫ И ФУНКЦИИ ПО РАБОТЕ С РЕГЛАМЕНТНЫМИ ЗАДАНИЯМИ //
//                                                         //
////////////////////////////////////////////////////////////


&НаСервере
Процедура УстановитьРасписаниеРегламентногоЗаданияПриЧтенииНаСервере(ТекущийОбъект)
	
	Задание = ТекущийОбъект.ПолучитьРегламентноеЗадание();
	
	Если НЕ Задание = Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = Задание.Расписание;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентныеЗаданияПриИзменении(Элемент)
	
	ПриИзмененииИспользоватьРегламентныеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИспользоватьРегламентныеЗадания()
	
	УстановитьДоступностьРасписанияОбмена();
	
	Если Объект.ИспользоватьРегламентныеЗадания Тогда
		
		ВыполнитьНастройкуРасписанияОбмена();
		УстановитьНадписьРасписанияОбмена();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьРасписанияОбмена()
	
	Если РасписаниеРегламентногоЗадания = НеОпределено Тогда
		ТекстЗаголовка = НСтр("ru='Настроить расписание обмена'");
	Иначе
		ТекстЗаголовка = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеОбмена.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРасписанияОбмена()
	
	Элементы.НастроитьРасписаниеОбмена.Доступность = Объект.ИспользоватьРегламентныеЗадания;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияОбмена()
	
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменятьРасписаниеLongPulling", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменятьРасписаниеLongPulling(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = РасписаниеЗадания;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОбмена(Команда)
	
	ВыполнитьНастройкуРасписанияОбмена();
	УстановитьНадписьРасписанияОбмена();
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыВыполненияОбмена

////////////////////////////////////////////////////////////////
//                                                           //
//  ПРОЦЕДУРЫ ВЫПОЛНЕНИЯ ОБМЕНА								//
//                                                         //
////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВыполнитьОбменДанными(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСохраненииНастройкиОбменаДанных", ЭтаФорма, Параметры), "Настройка обмена изменена и не записана. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗапускОбменаИнтерактивно(Объект.Ссылка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСохраненииНастройкиОбменаДанных(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
				
		Если НЕ Записать() Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗапускОбменаИнтерактивно(Объект.Ссылка);
	
    КонецЕсли;

КонецПроцедуры

#Область ПрочиеФункцииИПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаКлиенте
Процедура ЗапускОбменаИнтерактивно(УзелОбмена)
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("УзелОбмена", УзелОбмена);
	
	ЗапускОбменаИнтерактивноНаСервере(ПараметрыОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ЗапускОбменаИнтерактивноНаСервере(ПараметрыОбмена)
	
	смартИнтеграцияАтлант.ВыполнитьЗаданиеОбменСоСкладомАтлант(ПараметрыОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьАтлантНастройкиОтбораНоменклатуры();

	АтлантFTPСхемаОтбораНоменклатуры = ПланыОбмена.смартОбменСоСкладомАтлант.ПолучитьМакет("АтлантFTPСхемаОтбораНоменклатуры");
	
	АтлантFTPНастройкиОтбораНоменклатуры = РеквизитФормыВЗначение("Объект").АтлантFTPНастройкиОтбораНоменклатуры.Получить();
	
	Если ТипЗнч(АтлантFTPНастройкиОтбораНоменклатуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		НастройкиОтбораНоменклатуры = АтлантFTPНастройкиОтбораНоменклатуры;
	Иначе
		НастройкиОтбораНоменклатуры = АтлантFTPСхемаОтбораНоменклатуры.НастройкиПоУмолчанию;
	КонецЕсли;

	УстановитьАтлантНастройкиОтбораНоменклатуры(НастройкиОтбораНоменклатуры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьАтлантНастройкиОтбораНоменклатуры(НастройкиКомпоновки)
	
	АтлантFTPСхемаОтбораНоменклатуры = ПланыОбмена.смартОбменСоСкладомАтлант.ПолучитьМакет("АтлантFTPСхемаОтбораНоменклатуры");
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(
								 ПоместитьВоВременноеХранилище(АтлантFTPСхемаОтбораНоменклатуры, Новый УникальныйИдентификатор()));

	КомпоновщикНастроекОтбораНоменклатурыАтлант.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроекОтбораНоменклатурыАтлант.ЗагрузитьНастройки(НастройкиКомпоновки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАтлантНастройкиОтбораНоменклатурыПоУмолчанию(Команда)
	
	УстановитьАтлантНастройкиОтбораНоменклатурыПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьАтлантНастройкиОтбораНоменклатурыПоУмолчаниюНаСервере()
	
	АтлантFTPСхемаОтбораНоменклатуры = ПланыОбмена.смартОбменСоСкладомАтлант.ПолучитьМакет("АтлантFTPСхемаОтбораНоменклатуры");
	
	УстановитьАтлантНастройкиОтбораНоменклатуры(АтлантFTPСхемаОтбораНоменклатуры.НастройкиПоУмолчанию);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
